;; -*- no-byte-compile: t; -*- $DOOMDIR/packages.el ;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;                                                                            ;;
;;                    __                                      __              ;;
;; .-----.---.-.----.|  |--.---.-.-----.-----.-----.  .-----.|  |             ;;
;; |  _  |  _  |  __||    <|  _  |  _  |  -__|__ --|__|  -__||  |             ;;
;; |   __|___._|____||__|__|___._|___  |_____|_____|__|_____||__|             ;;
;; |__|                          |_____|                                      ;;
;;                                                                            ;;
;; Emilia's packages.el                                                       ;;
;; Edited: 2021-04-09                                                         ;;
;; Author: Emilia Dunfelt, edun@dunfelt.se                                    ;;
;;                                                                            ;;
;; Structure:                                                                 ;;
;; 1. Appearance                                                              ;;
;; 2. Utilities                                                               ;;
;; 3. Research                                                                ;;
;;                                                                            ;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; 1. Appearance
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(package! base16-theme)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; 2. Utilities
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(package! evil-easymotion)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; 3. Research
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(package! org-ref)
(package! helm-bibtex)
(package! org-roam-bibtex)
(package! org-noter)
(package! org-roam-server :recipe (:host github :repo "org-roam/org-roam-server" :files ("*")))
(unpin! org-roam)
(package! org-journal)
